// Author: Ambrose Xu

var cardScoreMap = {
    "A1": 1,
    "A2": 2,
    "A3": 4,
    "A4": 8,
    "A5": 16,
    "A6": 32,
    "A7": 64,
    "B1": 1,
    "B2": 2,
    "B3": 4,
    "B4": 8,
    "B5": 16,
    "B6": 32,
    "B7": 64
};

var nameBScoreMap = {
    "0": "",
    "1": "冯",
    "2": "诸葛",
    "3": "陈",
    "4": "崔",
    "5": "褚",
    "6": "武",
    "7": "卫",
    "8": "东方",
    "9": "蒋",
    "10": "裘",
    "11": "沈",
    "12": "平",
    "13": "韩",
    "14": "阎",
    "15": "杨",
    "16": "丘",
    "17": "齐",
    "18": "庄",
    "19": "章",
    "20": "耿",
    "21": "兰",
    "22": "俞",
    "23": "谷",
    "24": "温",
    "25": "麦",
    "26": "吉",
    "27": "游",
    "28": "单",
    "29": "仇",
    "30": "缪",
    "31": "詹",
    "32": "西门",
    "33": "司徒",
    "34": "慕容",
    "35": "甘",
    "36": "卞",
    "37": "庞",
    "38": "党",
    "39": "祝",
    "40": "符",
    "41": "于",
    "42": "和",
    "43": "包",
    "44": "文",
    "45": "巫",
    "46": "兆",
    "47": "冷",
    "48": "草",
    "49": "曲",
    "50": "卓",
    "51": "樊",
    "52": "凌",
    "53": "翁",
    "54": "纪",
    "55": "宫",
    "56": "年",
    "57": "项",
    "58": "毕",
    "59": "韦",
    "60": "蓝",
    "61": "练",
    "62": "冉",
    "63": "燕",
    "64": "习",
    "65": "路",
    "66": "宁",
    "67": "辛",
    "68": "焦",
    "69": "霍",
    "70": "蒙",
    "71": "鲍",
    "72": "藤",
    "73": "米",
    "74": "解",
    "75": "蒲",
    "76": "房",
    "77": "景",
    "78": "饶",
    "79": "裴",
    "80": "屈",
    "81": "邵",
    "82": "巴",
    "83": "尤",
    "84": "修",
    "85": "萧",
    "86": "辜",
    "87": "阳",
    "88": "丛",
    "89": "简",
    "90": "穆",
    "91": "连",
    "92": "薄",
    "93": "牟",
    "94": "秦",
    "95": "安",
    "96": "时",
    "97": "植",
    "98": "傅",
    "99": "柴",
    "100": "骆",
    "101": "池",
    "102": "廉",
    "103": "洪",
    "104": "农",
    "105": "乔",
    "106": "展",
    "107": "古",
    "108": "管",
    "109": "邢",
    "110": "车",
    "111": "臧",
    "112": "谭",
    "113": "靳",
    "114": "司",
    "115": "席",
    "116": "芦",
    "117": "奚",
    "118": "甄",
    "119": "冼",
    "120": "颜",
    "121": "费",
    "122": "边",
    "123": "查",
    "124": "隋",
    "125": "葛",
    "126": "黎",
};

function main(args) {
    var evaluationResult = new EvaluationResult('我猜您的姓氏是：');

    var hitSnList = [];

    for (var i = 0; i < args.length; ++i) {
        var question = args[i];
        var answer = question.getAnswer();
        if (null != answer) {
            if (answer.code === 'true') {
                hitSnList.push(question.sn);
            }
        }
    }

    var total = 0;
    for (var i = 0; i < hitSnList.length; ++i) {
        var score = cardScoreMap[hitSnList[i]];
        total += score;
    }

    if (0 === total) {
        // 没有得分
        return evaluationResult;
    }
    else if (127 === total) {
        // 得分越界
        evaluationResult.setTerminated(true);
        return evaluationResult;
    }

    var name = nameBScoreMap[total.toString()];
    if (name.length > 0) {
        evaluationResult.setTerminated(true);
        evaluationResult.setResult(name);
    }
    return evaluationResult;
}
